<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest MakerBot Desktop Bundle.</string>
    <key>Identifier</key>
    <string>com.github.groob.download.makerbot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakerBot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\/(MakerBot\+Bundle\+(BETA\+)?[\d\.]+\.dmg)</string>
                <key>result_output_var_name</key>
                <string>filename</string>
                <key>url</key>
                <string>https://support.makerbot.com/troubleshooting/makerbot-desktop-software/software-download/download_12190</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://s3.amazonaws.com/downloads-makerbot-com/makerware/%filename%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
