<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest SketchUp Make disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.groob.munki.SketchupMake</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SketchUp 2013</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/sketchup</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Google SketchUp Make</string>
            <key>display_name</key>
            <string>SketchUp Make 2013</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>installer_type</key>
            <string>copy_from_dmg</string>
            <key>installs</key>
            <array>
              <dict>
                <key>path</key>
                <string>/Applications/SketchUp 2013</string>
                <key>type</key>
                <string>file</string>
              </dict>
            </array>
            <key>items_to_copy</key>
            <array>
              <dict>
                <key>destination_path</key>
                <string>/Applications</string>
                <key>source_item</key>
                <string>SketchUp 2013</string>
              </dict>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.groob.download.SketchupMake</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
